In [1]:
# Aula 02 - Configuração de ambiente Python

In [2]:
print('Inteligencia Artificial e Big Data - aula 02')

Inteligencia Artificial e Big Data - aula 02

In [ ]:
# instalação biblioteca pandas
!pip install pandas

In [4]:
# importar a biblioteca pandas
import pandas as pd

In [5]:
# Criando um dicionario no Python

Dicionario = {
    'A': [1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}

# Criando um index para linhas do dicionario
Label = ['1ª Linha','2ª Linha','3ª Linha']

# Criar o Dataframe
Dataframe_01 = pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [6]:
# Selecionando colunas A e B
Dataframe_01[['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2
3ª Linha  3 -1

In [7]:
# Selecionando as colunas A e C
Dataframe_01[['A','C']]

          A   C
1ª Linha  1   0
2ª Linha  2  10
3ª Linha  3  20

In [8]:
# Criando uma nova coluna no Dataframe
Dataframe_01['Nova coluna'] = Dataframe_01['A']*Dataframe_01['B']

In [9]:
# Exibindo o Dataframe
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [12]:
# Exibindo mais de um valor na celula do Jupyter notebook
a =5
print(a)
Dataframe_01

5

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [13]:
# Excluindo uma coluna do Dataframe
Dataframe_01.drop('Nova coluna',axis=1) # drop exclui a coluna do
# Dataframe

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
Dataframe_01.drop('1ª Linha',axis=0) # drop exclui a linha  do
# Dataframe

          A  B   C  Nova coluna
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [17]:
Dataframe_01

          A  B   C  Nova coluna
1ª Linha  1 -3   0           -3
2ª Linha  2 -2  10           -4
3ª Linha  3 -1  20           -3

In [18]:
# Excluindo uma coluna do Dataframe de forma permanente
Dataframe_01.drop('Nova coluna',axis=1,inplace=True) # drop exclui a coluna do
# Dataframe

In [19]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [20]:
# Localizando uma linha no Dataframe
Dataframe_01.loc['1ª Linha'] #localiza uma linha do Dataframe

A    1
B   -3
C    0
Name: 1ª Linha, dtype: int64

In [21]:
# Localizando uma linha no Dataframe
Dataframe_01.loc['2ª Linha']

A     2
B    -2
C    10
Name: 2ª Linha, dtype: int64

In [24]:
# Localizando uma linha no Dataframe
Dataframe_01.loc['3ª Linha']

A     3
B    -1
C    20
Name: 3ª Linha, dtype: int64

In [27]:
# Localizando linha e coluna
Dataframe_01.loc[['1ª Linha','2ª Linha'],['A','B']]

          A  B
1ª Linha  1 -3
2ª Linha  2 -2

In [ ]:
Dataframe_01.head() # mostra as 4 primeiras linhas do Dataframe

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
Dataframe_01.tail() # Mostra as 4 ultimas linhas do Dataframe

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [33]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[2:3,1:] # Linha, coluna

          B   C
3ª Linha -1  20

In [34]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[2:3] # Linha, coluna

          A  B   C
3ª Linha  3 -1  20

In [45]:
# Localizando linhas pelo indice numerico
Dataframe_01.iloc[:,2] # Linha, coluna

1ª Linha     0
2ª Linha    10
3ª Linha    20
Name: C, dtype: int64

In [46]:
# Criando filtro condicional no Dataframe
Filtro = Dataframe_01['C']>0 # Armazena o resultado na variavel filtro
Dataframe_02 = Dataframe_01[Filtro]

In [47]:
Dataframe_02

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
Dataframe_01>0 # retornar onde os numero sao maior que 0

             A      B      C
1ª Linha  True  False  False
2ª Linha  True  False   True
3ª Linha  True  False   True

In [49]:
Filtro

1ª Linha    False
2ª Linha     True
3ª Linha     True
Name: C, dtype: bool

In [50]:
# Criando filtro de duas colunas
Dataframe_01[(Dataframe_01['A']>1)& (Dataframe_01['C']>0)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [53]:
# Criando filtro de duas colunas com a logica or
Dataframe_01[(Dataframe_01['A']>5)| (Dataframe_01['C']>2)]

          A  B   C
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [54]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [55]:
# Resetando o index do Dataframe
Dataframe_01.reset_index()

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [56]:
Dataframe_01

          A  B   C
1ª Linha  1 -3   0
2ª Linha  2 -2  10
3ª Linha  3 -1  20

In [ ]:
# Resetando o index do Dataframe de forma definitiva
Dataframe_01.reset_index(inplace= True) # reseta o index na base de dados original

In [58]:
Dataframe_01

      index  A  B   C
0  1ª Linha  1 -3   0
1  2ª Linha  2 -2  10
2  3ª Linha  3 -1  20

In [59]:
# Excluindo a coluna do index
Dataframe_01.drop('index',axis=1,inplace= True)

In [60]:
Dataframe_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20